name:"convolution"
input:"data"
input_dim:1 #batch_size
input_dim:1 #channel
inpput_dim:100 #height
input_dim:100 #width
layer{
name:"conv"
type:"Convolution"
bottom:"data"
top:"conv"
convolution_param{
num_output:3
kernel_size:5
stride:1
weight_filler{
type:"gaussian"
std:0.01
}
bias_filler{
type:"constant"
value:0
}
}
}
}
